#include "eeprom.h"
#include "I2C.h"



/***********************************************E2PROM读取字节函数************************************************/
/*                                   读取EEPROM中的一个字节    addr：字节地址                                    */
/*****************************************************************************************************************/
uchar E2ReadByte(uchar addr)
{
	uchar dat;
	I2C_Start();
	I2C_Write(0x50<<1);                             //寻址器件 后续为写操作
	I2C_Write(addr);                                //写入存储地址
	I2C_Start();                                    //发送重复起始信号
	I2C_Write((0x50<<1)|0x01);                      //寻址器件 后续为读操作
	dat=I2CReadNAK();                               //读取一个字节数据
	I2C_Stop();
	return dat;
}

/***********************************************E2PROM写入字节函数************************************************/
/*                                   向E2PROM中写入一个字节  addr:字节地址 dat：数据                             */
/*****************************************************************************************************************/
void E2WriteByte(uchar addr,uchar dat)
{
	I2C_Start();
	I2C_Write(0x50<<1);                             //寻址器件 后续为写操作
	I2C_Write(addr);                                //写入存储地址
	I2C_Write(dat);                                 //写入一个字节数据
	I2C_Stop();
}


/**********************************************EEPROM读取数据函数*************************************************/
/*                            buf：数据接收指针 addr：EEPROM起始地址 len：读取数据长度                           */
/*****************************************************************************************************************/
void E2P_Read(uchar *buf,uchar addr,uchar len)
{
	do                                                //通过寻址操作判断当前是否可进行读写
	{
		I2C_Start();
		if(I2C_Write(0x50<<1))                          //应答则跳出循环 非应答则继续查询
			break;
		I2C_Stop();
	}while(1);
	
	I2C_Write(addr);                                  //写入起始地址
	I2C_Start();                                      //发送重复起始信号
	I2C_Write((0x50<<1)|0x01);                        //寻址器件 后续为读操作
	while(len>1)                                      //连续读取len—1个字节
	{
		*buf++=I2CReadACK();                            //最后字节之前为读取操作+应答
		len--;
	}
	*buf=I2CReadNAK();                                //最后一个字节为读取操作+非应答
	I2C_Stop();
}

/**********************************************EEPROM写入数据函数*************************************************/
/*                            buf：数据发送指针 addr：EEPROM起始地址 len：写入数据长度                           */
/*****************************************************************************************************************/
void E2P_Write(uchar *buf,uchar addr,uchar len)
{
	while(len>0)
	{
		do
		{
			I2C_Start();
		  if(I2C_Write(0x50<<1))                          //应答则跳出循环 非应答则继续查询
				break;
		  I2C_Stop();
	  }while(1);
		
		I2C_Write(addr);                                  //写入起始地址
		while(len>0)
		{
			I2C_Write(*buf++);                              //写入一个字节数据
			len--;
			addr++;                                         //地址计数递增
			if((addr|0x07)==0)                              //24c02共256个字节 8个字节为1页 一共32页 
				                                              //addr低三位为0 那么addr为8的倍数 说明已经跨页
				                                              //如果跨页则跳出当前while循环
				break;
		}
		I2C_Stop();
	}
}
