#include"ds1302.h"


/**************************************************DS1302初始化函数*************************************************/
/*                                                                                                                 */          
/*******************************************************************************************************************/
void InitDS1302()
{
	uchar dat;
	struct STime code InitTime[]={                       //初始时间 2017年3月20日 12:30:00 星期一
		0x2017,0x03,0x20,0x12,0x30,0x00,0x01
	};
  DS1302_CE = 0;
	DS1302_SCK = 0;                                      //初始化引脚 (拉低时钟引脚和使能引脚)
	
	dat=DS1302_SingleRead(0);                            //读取秒寄存器
	if((dat&0x80)!=0)                                    //由秒寄存器最高位CH判断DS1302是否停止
	{
		DS1302_SingleWrite(7,0x00);                        //撤销写保护 允许写入数据
		SetRealTime(&InitTime);                            //设置默认初始时间
	}
}

/**************************************************DS1302读取数据函数***********************************************/
/*                                           从DS1302通信总线上读取一个字节                                        */          
/*******************************************************************************************************************/
uchar DS1302_ByteRead()
{
	uchar mask;
	uchar dat=0;
	
	for(mask=0x01;mask!=0;mask<<=1)
	{
		if(DS1302_IO!=0)                                   //读取I0引脚 并且设置dat
		{
			dat|=mask;
		}
		DS1302_SCK=1;                                      //拉高sck再拉低 完成一个位的操作
		_nop_();
		DS1302_SCK=0;
		_nop_();
		DS1302_IO=0;                                       //拉低IO引脚
		
	}
	return dat;                                          //返回dat的值
} 

/**************************************************DS1302写数据函数*************************************************/
/*                                            发送一个字节到DS1302通信总线上                                       */          
/*******************************************************************************************************************/
void DS1302_ByteWrite(uchar dat)
{
	uchar mask;
	
	for(mask=0x01;mask!=0;mask<<=1)
	{
		if((mask&dat)!=0)                              //对DS1302_IO引脚进行操作
		{
			DS1302_IO=1;
		}
		else
		{
			DS1302_IO=0;
		}
		
	  DS1302_SCK=1;                                  //完成一个位的操作
		_nop_();
		DS1302_SCK=0;
	}
	DS1302_IO=1;                                    //释放IO引脚
}

/**************************************************DS1302读寄存器函数***********************************************/
/*                           用单次读操作从某一寄存器读取一个字节     reg:寄存器地址                               */          
/*******************************************************************************************************************/
uchar DS1302_SingleRead(uchar reg)
{
	uchar dat;
	
	DS1302_CE=1;                                         //使能片选信号
	DS1302_ByteWrite((reg<<1)|0x81);                     //发送读寄存器指令 最低位是1表示读 最高位固定为1
	dat=DS1302_ByteRead();                               //读取数据
	DS1302_CE=0;
	return dat;                                          //返回dat的值
}

/**************************************************DS1302写寄存器函数***********************************************/
/*                           用单次写操作向某一寄存器写入一个字节     reg:寄存器地址  dat:写入的数据               */          
/*******************************************************************************************************************/
void DS1302_SingleWrite(uchar reg,uchar dat)
{
	DS1302_CE=1;
	DS1302_ByteWrite((reg<<1)|0x80);                     //发送写寄存器指令
	DS1302_ByteWrite(dat);                               //写入数据
	DS1302_CE=0;
}

/**************************************************突发模式写入函数*************************************************/
/*                                   用突发模式连续写入8个寄存器数据 dat：待写入数据指针                           */          
/*******************************************************************************************************************/
void DS1302_BurstWrite(uchar *dat)
{
	uchar i=0;
	DS1302_CE=1;
	DS1302_ByteWrite(0xBE);                          //发送突发写寄存器指令
	for(i=0;i<8;i++)                                 //连续写入8个字节数据
	{
		DS1302_ByteWrite(dat[i]);
	}
	DS1302_CE=0;
}

/**************************************************突发模式读取函数*************************************************/
/*                                   用突发模式连续读取8个寄存器数据 dat：读取数据指针                             */          
/*******************************************************************************************************************/
void DS1302_BurstRead(uchar *dat)
{
	uchar i=0;
	DS1302_CE=1;
	DS1302_ByteWrite(0xBF);                          //发送突发读寄存器指令
	for(i=0;i<8;i++)                                 //连续读取8个字节数据
	{
		dat[i]=DS1302_ByteRead();
	}
	DS1302_CE=0;
	
	
}

/**************************************************获取实时时间*****************************************************/
/*                                  读取DS1302当前时间并转换为时间结构体格式                                       */          
/*******************************************************************************************************************/
void GetRealTime(struct STime *time)
{
	uchar buf[8];
	DS1302_BurstRead(buf);
	
	time->year = buf[6]+0x2000;
	time->mon = buf[4];
	time->day = buf[3];
	time->hour = buf[2];
	time->min = buf[1];
	time->sec = buf[0];
	time->week = buf[5];

}

/**************************************************设定实时时间*****************************************************/
/*                                   时间结构体格式的设定时间转换为数组并写入DS1302                                */          
/*******************************************************************************************************************/
void SetRealTime(struct STime *time)
{
	uchar buf[8];
	
	buf[7] = 0;
	buf[6] = time->year;
	buf[5] = time->week;
	buf[4] = time->mon;
	buf[3] = time->day;
	buf[2] = time->hour;
	buf[1] = time->min;
	buf[0] = time->sec;
	
	DS1302_BurstWrite(buf);
}